# 数据应用学院Data Scientist Program Hw1

In [1]:
import numpy as np
import pandas as pd

### 1. Please rewrite the following function to lambda expression

In [2]:
# lambda expression
def AddOne(x):
    # return x+1
    y=x+1
    return y

In [3]:
lambda x: x + 1

### 2. What's the difference between tuple and list?

In [4]:
# tuple is immutable

### 3. Why set is faster than list in python?

In [5]:
# set is implemented by hash table since it has unique elements

### 4. What's the major difference between array in numpy and series in pandas?

In [6]:
# series can be indexed by any names

### 5. read csv data into pandas dataframe, and display a sample of data

In [7]:
import os
from __future__ import division
os.chdir('C:\Users\hua\Desktop\DataLab')
train = pd.read_csv('train.csv')
train.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
651,652,1,2,"Doling, Miss. Elsie",female,18.0,0,1,231919,23.0,NaN,S

### 6. what's the percentage of null value in 'Age'

In [8]:
1 - train.count()['Age']/len(train)

# or

train.Age.isnull().sum() / len(train)

0.19865319865319866

### 7. how many unique classes in 'Embarked'

In [15]:
train['Embarked'].unique()
# there are 3 unique classes

# or

train.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

 8. percentage of male passangers that survived? 
    percentage of female passangers that survived?

In [10]:
male_pass = train[train.Sex == 'male']
len(male_pass[male_pass.Survived == 1]) / len(male_pass)

0.18890814558058924

In [18]:
sum((train.Sex == 'female') & (train.Survived == 1)) / sum(train.Sex == 'female')

0.7420382165605095

### 9. show me passangers that are 23 years old.

In [11]:
twenty_three_pass = train[train.Age == 23]
twenty_three_pass

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C
135,136,0,2,"Richard, Mr. Emile",male,23.0,0,0,SC/PARIS 2133,15.0458,NaN,C
350,351,0,3,"Odahl, Mr. Nils Martin",male,23.0,0,0,7267,9.2250,NaN,S
393,394,1,1,"Newell, Miss. Marjorie",female,23.0,1,0,35273,113.2750,D36,C
398,399,0,2,"Pain, Dr. Alfred",male,23.0,0,0,244278,10.5000,NaN,S
473,474,1,2,"Jerwan, Mrs. Amin S (Marie Marthe Thuillard)",female,23.0,0,0,SC/AH Basle 541,13.7917,D,C
529,530,0,2,"Hocking, Mr. Richard George",male,23.0,2,1,29104,11.5000,NaN,S
649,650,1,3,"Stanley, Miss. Amy Zillah Elsie",female,23.0,0,0,CA. 2314,7.5500,NaN,S
658,659,0,2,"Eitemiller, Mr. George Floyd",male,23.0,0,0,29751,13.0000,NaN,S
733,734,0,2,"Berriman, Mr. William John",male,23.0,0,0,28425,13.0000,NaN,S
734,735,0,2,"Troupiansky, Mr. Moses Aaron",male,23.0,0,0,233639,13.0000,NaN,S
753,754,0,3,"Jonkoff, Mr. Lalio",male,23.0,0,0,349204,7.8958,NaN,S
816,817,0,3,"Heininen, Miss. Wendla Maria",female,23.0,0,0,STON/O2. 3101290,7.9250,NaN,S
833,834,0,3,"Augustsson, Mr. Albert",male,23.0,0,0,347468,7.8542,NaN,S

### 10. is there a Jack or Rose in our dataset?

In [12]:
train[train.Name.str.contains('Jack|Rose')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
766,767,0,1,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.60,NaN,C
855,856,1,3,"Aks, Mrs. Sam (Leah Rosen)",female,18.0,0,1,392091,9.35,NaN,S

### 11. percentage of surviving when passangers' pclass is 1?

In [13]:
p1_pass = train[train.Pclass == 1]
len(p1_pass[p1_pass.Survived == 1]) / len(p1_pass)

0.6296296296296297